Chapter04/HumanTaskApps/HumanTaskRouting/SOA/testsuites/TestData12c.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:start xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/HumanTaskRouting"
               xmlns:ns2="http://www.mycompany.com/ns/salesquote">
      <ns2:QuoteRequest>
        <ns2:Summary>
          <ns2:OpportunityID>1001</ns2:OpportunityID>
          <ns2:AccountName>ABC1001</ns2:AccountName>
          <ns2:NewCustomer>Yes</ns2:NewCustomer>
          <ns2:Address>
            <ns2:Street>SomeStreet</ns2:Street>
            <ns2:City>SomeCity</ns2:City>
            <ns2:State>FL</ns2:State>
            <ns2:Zip>33178</ns2:Zip>
            <ns2:Country>US</ns2:Country>
          </ns2:Address>
          <ns2:CustomerType></ns2:CustomerType>
          <ns2:Industry>IT</ns2:Industry>
          <ns2:SalesRepId>salesrep</ns2:SalesRepId>
          <ns2:SalesRepName></ns2:SalesRepName>
          <ns2:SalesRepContact></ns2:SalesRepContact>
        </ns2:Summary>
        <ns2:ProductItem>
          <ns2:ProductID>1111</ns2:ProductID>
          <ns2:ProductName>ABC1111</ns2:ProductName>
          <ns2:Quantity>11</ns2:Quantity>
          <ns2:ListPrice>11</ns2:ListPrice>
          <ns2:RequestedDiscount>1</ns2:RequestedDiscount>
          <ns2:Approval>
            <ns2:Approver></ns2:Approver>
            <ns2:Title></ns2:Title>
            <ns2:ApprovalNote></ns2:ApprovalNote>
          </ns2:Approval>
        </ns2:ProductItem>
        <ns2:ProductItem>
          <ns2:ProductID>2222</ns2:ProductID>
          <ns2:ProductName>ABC2222</ns2:ProductName>
          <ns2:Quantity>22</ns2:Quantity>
          <ns2:ListPrice>22</ns2:ListPrice>
          <ns2:RequestedDiscount>2</ns2:RequestedDiscount>
          <ns2:Approval>
            <ns2:Approver></ns2:Approver>
            <ns2:Title></ns2:Title>
            <ns2:ApprovalNote></ns2:ApprovalNote>
          </ns2:Approval>
        </ns2:ProductItem>
        <ns2:ProductItem>
          <ns2:ProductID>3333</ns2:ProductID>
          <ns2:ProductName>ABC3333</ns2:ProductName>
          <ns2:Quantity>33</ns2:Quantity>
          <ns2:ListPrice>33</ns2:ListPrice>
          <ns2:RequestedDiscount>3</ns2:RequestedDiscount>
          <ns2:Approval>
            <ns2:Approver></ns2:Approver>
            <ns2:Title></ns2:Title>
            <ns2:ApprovalNote></ns2:ApprovalNote>
          </ns2:Approval>
        </ns2:ProductItem>
        <ns2:QuoteRequestStatus>New</ns2:QuoteRequestStatus>
        <ns2:RecommendedDiscount>
          <ns2:RevenueRange>1</ns2:RevenueRange>
          <ns2:SuggestedDiscount>2</ns2:SuggestedDiscount>
          <ns2:FutureDiscountProvision>3</ns2:FutureDiscountProvision>
        </ns2:RecommendedDiscount>
        <ns2:OrganizationUnit>SalesOrg</ns2:OrganizationUnit>
      </ns2:QuoteRequest>
    </ns1:start>
  </soap:Body>
</soap:Envelope>
